In [6]:
from itertools import count

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from pandas.core.dtypes.inference import is_bool
from pywin.framework.interact import formatInput


import datetime
import seaborn as sns

ModuleNotFoundError: No module named 'seaborn'

In [2]:
df=pd.read_csv(r"C:\Users\dai\Downloads\tips.csv")
df

,total_bill,tip,gender,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3.560330e+15,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4.478070e+15,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6.011810e+15,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4.676140e+15,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4.832730e+15,Sun2251
...,...,...,...,...,...,...,...,...,...,...,...
239,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5.296070e+15,Sat2657
240,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3.506810e+15,Sat1766
241,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6.011890e+15,Sat3880
242,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4.375220e+12,Sat17
243,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3.511450e+15,Thur672

# **Groupby**

In [4]:
x=df.groupby('gender')
list(x)[1][1]

,total_bill,tip,gender,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4.478070e+15,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6.011810e+15,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4.676140e+15,Sun5260
5,25.29,4.71,Male,No,Sun,Dinner,4,6.32,Erik Smith,2.131400e+14,Sun9679
6,8.77,2.00,Male,No,Sun,Dinner,2,4.38,Kristopher Johnson,2.223730e+15,Sun5985
...,...,...,...,...,...,...,...,...,...,...,...
236,12.60,1.00,Male,Yes,Sat,Dinner,2,6.30,Matthew Myers,3.543680e+15,Sat5032
237,32.83,1.17,Male,Yes,Sat,Dinner,2,16.42,Thomas Brown,4.284720e+15,Sat2929
239,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5.296070e+15,Sat2657
241,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6.011890e+15,Sat3880
242,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4.375220e+12,Sat17

In [5]:
x=df.groupby(['gender','day']).agg({'tip':['mean','sum','min','max']}).reset_index()
x

   gender   day       tip
                     mean     sum   min    max
0  Female   Fri  2.781111   25.03  1.00   4.30
1  Female   Sat  2.801786   78.45  1.00   6.50
2  Female   Sun  3.367222   60.61  1.01   5.20
3  Female  Thur  2.575625   82.42  1.25   5.17
4    Male   Fri  2.693000   26.93  1.50   4.73
5    Male   Sat  3.083898  181.95  1.00  10.00
6    Male   Sun  3.220345  186.78  1.32   6.50
7    Male  Thur  2.980333   89.41  1.44   6.70

# MS Dhonir Record

In [19]:
df = pd.read_csv(r"C:\Users\dai\Downloads\MS_Dhoni_ODI_Record.csv")

In [28]:
print(df.head())
df.head()

  score runs_scored balls_faced strike_rate fours sixes  opposition  \
0     0           0           1           0     0     0  Bangladesh
1    12          12          11      109.09     2     0  Bangladesh
2    7*           7           2         350     0     1  Bangladesh
3     3           3           7       42.85     0     0    Pakistan
4   148         148         123      120.32    15     4    Pakistan

          ground       date  odi_number  year
0     Chattogram 2004-12-23  ODI # 2199  2004
1          Dhaka 2004-12-26  ODI # 2201  2004
2          Dhaka 2004-12-27  ODI # 2202  2004
3          Kochi 2005-04-02  ODI # 2235  2005
4  Visakhapatnam 2005-04-05  ODI # 2236  2005

,score,runs_scored,balls_faced,strike_rate,fours,sixes,opposition,ground,date,odi_number,year
0,0,0,1,0,0,0,Bangladesh,Chattogram,2004-12-23,ODI # 2199,2004
1,12,12,11,109.09,2,0,Bangladesh,Dhaka,2004-12-26,ODI # 2201,2004
2,7*,7,2,350,0,1,Bangladesh,Dhaka,2004-12-27,ODI # 2202,2004
3,3,3,7,42.85,0,0,Pakistan,Kochi,2005-04-02,ODI # 2235,2005
4,148,148,123,120.32,15,4,Pakistan,Visakhapatnam,2005-04-05,ODI # 2236,2005

In [26]:
# df['opposition'] = df['opposition'].apply(lambda x: x[2:])
df['opposition'] = df['opposition'].str.replace('v ','',regex = False)
df

,score,runs_scored,balls_faced,strike_rate,fours,sixes,opposition,ground,date,odi_number
0,0,0,1,0,0,0,Bangladesh,Chattogram,23/12/2004,ODI # 2199
1,12,12,11,109.09,2,0,Bangladesh,Dhaka,26/12/2004,ODI # 2201
2,7*,7,2,350,0,1,Bangladesh,Dhaka,27/12/2004,ODI # 2202
3,3,3,7,42.85,0,0,Pakistan,Kochi,02/04/2005,ODI # 2235
4,148,148,123,120.32,15,4,Pakistan,Visakhapatnam,05/04/2005,ODI # 2236
...,...,...,...,...,...,...,...,...,...,...
345,56*,56,61,91.8,3,2,West Indies,Manchester,27/06/2019,ODI # 4175
346,42*,42,31,135.48,4,1,England,Birmingham,30/06/2019,ODI # 4179
347,35,35,33,106.06,4,0,Bangladesh,Birmingham,02/07/2019,ODI # 4182
348,DNB,-,-,-,-,-,Sri Lanka,Leeds,06/07/2019,ODI # 4187
349,50,50,72,69.44,1,1,New Zealand,Manchester,09/07/2019,ODI # 4190

In [27]:
df['date'] = pd.to_datetime(df['date'],dayfirst = True)
df['year'] = df['date'].dt.year.astype(int)

In [ ]:
df['score'] = df['score'].apply(str)
df['not_out'] = np.where(df['score'].str.endswith('*'),1,0)

In [33]:
#drop unnecesary col
df.drop(columns='odi_number',inplace = True)

KeyError: "['odi_number'] not found in axis"

In [36]:
# remove unnecessary rows having unnecessary values
df_new = df.loc[((df['score']!='DNB') & (df['score']!='TDNB')),'runs_scored':]

In [37]:
# df
df_new

,runs_scored,balls_faced,strike_rate,fours,sixes,opposition,ground,date,year
0,0,1,0,0,0,Bangladesh,Chattogram,2004-12-23,2004
1,12,11,109.09,2,0,Bangladesh,Dhaka,2004-12-26,2004
2,7,2,350,0,1,Bangladesh,Dhaka,2004-12-27,2004
3,3,7,42.85,0,0,Pakistan,Kochi,2005-04-02,2005
4,148,123,120.32,15,4,Pakistan,Visakhapatnam,2005-04-05,2005
...,...,...,...,...,...,...,...,...,...
344,28,52,53.84,3,0,Afghanistan,Southampton,2019-06-22,2019
345,56,61,91.8,3,2,West Indies,Manchester,2019-06-27,2019
346,42,31,135.48,4,1,England,Birmingham,2019-06-30,2019
347,35,33,106.06,4,0,Bangladesh,Birmingham,2019-07-02,2019
349,50,72,69.44,1,1,New Zealand,Manchester,2019-07-09,2019

In [38]:
#fixing the data type of numerical columns
df_new['runs_scored'] = df_new['runs_scored'].astype(int)
df_new['balls_faced'] = df_new['balls_faced'].astype(int)
df_new['strike_rate'] = df_new['fours'].astype(int)
df_new['fours'] = df_new['fours'].astype(int)
df_new['sixes'] = df_new['sixes'].astype(int)